//========================================================================
// libansnd
// Another Sound Library for Wii and GameCube homebrew.
//------------------------------------------------------------------------
// Copyright (c) 2025 James Sawyer
//
// This software is provided 'as-is', without any express or implied
// warranty. In no event will the authors be held liable for any damages
// arising from the use of this software.
//
// Permission is granted to anyone to use this software for any purpose,
// including commercial applications, and to alter it and redistribute it
// freely, subject to the following restrictions:
//
// 1. The origin of this software must not be misrepresented; you must not
//    claim that you wrote the original software. If you use this software
//    in a product, an acknowledgment in the product documentation would
//    be appreciated but is not required.
//
// 2. Altered source versions must be plainly marked as such, and must not
//    be misrepresented as being the original software.
//
// 3. This notice may not be removed or altered from any source
//    distribution.
//
//========================================================================

#include <stdio.h>
#include <unistd.h>
#include <string.h>
#include <math.h>
#include <ogcsys.h>
#include <gccore.h>
#include <ogc/lwp_watchdog.h>
#include <ogc/machine/processor.h>

#include "ansndlib.h"
#include "dspmixer.h"

//

#define MAX_PARAMETER_BLOCKS        ANSND_MAX_VOICES
#define PARAMETER_BLOCK_STRUCT_SIZE 128
#define DSP_DRAM_SIZE               8192
#define ANSND_SOUND_BUFFER_SIZE     960 // output 5ms stereo 16-bit sound data at 48kHz

// Values for the DSP Accelerator

#define DSP_ACCL_FMT_ADPCM          0x0000
#define DSP_ACCL_FMT_UNSIGNED_8BIT  0x0005
#define DSP_ACCL_FMT_SIGNED_8BIT    0x0019
#define DSP_ACCL_FMT_UNSIGNED_16BIT 0x0006
#define DSP_ACCL_FMT_SIGNED_16BIT   0x000A

#define DSP_ACCL_GAIN_ADPCM         0x0000
#define DSP_ACCL_GAIN_8BIT          0x0100
#define DSP_ACCL_GAIN_16BIT         0x0800

// DSP mailbox commands

#define DSP_MAIL_COMMAND            0xFACE0000 // command specifier
#define DSP_MAIL_END                0x0000DEAD // dsp terminate task
#define DSP_MAIL_NEXT               0x00001111 // dsp process next set of data
#define DSP_MAIL_PREPARE            0x00002222 // dsp prepare for next cycle
#define DSP_MAIL_MM_LOCATION        0x00003333 // cpu send main memory base locations
#define DSP_MAIL_RESTART            0x00004444 // dsp restart processing cycle
#define DSP_MAIL_YIELD              0x00005555 // dsp yield to next task

// Voice flags

#define VOICE_FLAG_PITCH_CHANGE     0x2000
#define VOICE_FLAG_CONFIGURED       0x1000
#define VOICE_FLAG_USED             0x0800
#define VOICE_FLAG_UPDATED          0x0400
#define VOICE_FLAG_INITIALIZED      0x0200
#define VOICE_FLAG_ERASED           0x0100
#define VOICE_FLAG_RUNNING          0x0080
#define VOICE_FLAG_FINISHED         0x0040
#define VOICE_FLAG_PAUSED           0x0020
#define VOICE_FLAG_DELAY            0x0010
#define VOICE_FLAG_STREAMING        0x0008
#define VOICE_FLAG_LOOPED           0x0004
#define VOICE_FLAG_ADPCM            0x0002
#define VOICE_FLAG_STEREO           0x0001

// Conversion helpers

#define HIGH(x)                     ((u16)(((x) & 0xFFFF0000) >> 16))
#define LOW(x)                      ((u16)((x) & 0x0000FFFF))
#define SAMPLES_TO_NIBBLES(x)       ((((x) / 14) * 16) + ((x) % 14) + 2)

//

typedef struct ansnd_parameter_block_t {
	s16 sample_buffer[16];                    // 0x00
	
	union {
		struct {
			s16 sample_buffer_2[16];          // 0x10
		} pcm;
		struct {
			u16 decode_coefficients[16];      // 0x10
		} adpcm;
	};
	
	s16 right_volume;                         // 0x20
	s16 left_volume;                          // 0x21
	
	u16 relative_frequency_high;              // 0x22
	u16 relative_frequency_low;               // 0x23
	u16 count_low;                            // 0x24
	
	s16 delay;                                // 0x25
	
	u16 flags;                                // 0x26
	
	u16 sample_buffer_index;                  // 0x27
	u16 sample_buffer_wrapping;               // 0x28
	
	u16 filter_step;                          // 0x29
	u16 filter_step_512;                      // 0x2A
	
	s16 correction_factor;                    // 0x2B
	
	u16 accelerator_format;                   // 0x2C
	
	u16 accelerator_start_high;               // 0x2D
	u16 accelerator_start_low;                // 0x2E
	u16 accelerator_end_high;                 // 0x2F
	u16 accelerator_end_low;                  // 0x30
	u16 accelerator_current_high;             // 0x31
	u16 accelerator_current_low;              // 0x32
	
	u16 initial_predictor_scale;              // 0x33
	s16 initial_sample_history_1;             // 0x34
	s16 initial_sample_history_2;             // 0x35
	
	u16 accelerator_gain;                     // 0x36
	
	union {
		struct {
			u16 padding[4];                   // 0x37
			
			u16 loop_start_high;              // 0x3B
			u16 loop_start_low;               // 0x3C
			
			u16 loop_predictor_scale;         // 0x3D
			s16 loop_sample_history_1;        // 0x3E
			s16 loop_sample_history_2;        // 0x3F
		} looping;
		struct {
			u16 next_buffer_start_high;       // 0x37
			u16 next_buffer_start_low;        // 0x38
			u16 next_buffer_end_high;         // 0x39
			u16 next_buffer_end_low;          // 0x3A
			u16 next_buffer_current_high;     // 0x3B
			u16 next_buffer_current_low;      // 0x3C
			
			u16 next_buffer_predictor_scale;  // 0x3D
			s16 next_buffer_sample_history_1; // 0x3E
			s16 next_buffer_sample_history_2; // 0x3F
		} streaming;
	};
} ansnd_parameter_block_t;

_Static_assert(sizeof(ansnd_parameter_block_t) == PARAMETER_BLOCK_STRUCT_SIZE, "Struct does not match expected size.");

typedef union {
	ansnd_pcm_stream_data_callback_t   pcm_callback;
	ansnd_adpcm_stream_data_callback_t adpcm_callback;
} ansnd_stream_data_callback_t;

typedef struct ansnd_voice_t {
	u32 samplerate;
	f32 pitch;
	
	u32 delay;
	
	u16 flags;
	
	f32 left_volume;
	f32 right_volume;
	
	u16 decode_coefficients[16];
	
	u16 accelerator_format;
	u16 accelerator_gain;
	
	u32 ram_buffer_start;
	u32 ram_buffer_end;
	u32 ram_buffer_first;
	
	u16 initial_predictor_scale;
	u16 initial_sample_history_1;
	u16 initial_sample_history_2;
	
	union {
		struct {
			u32 loop_start;
			u32 loop_end;
			
			u16 loop_predictor_scale;
			u16 loop_sample_history_1;
			u16 loop_sample_history_2;
		} looping;
		struct {
			u32 next_buffer_start;
			u32 next_buffer_end;
			u32 next_buffer_first;
			
